src/Catalogs/ДоговорыКонтрагентов/ДоговорыКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДоговорыКонтрагентов</name>
  <comment>(Общ)</comment>
  <hierarchical>true</hierarchical>
  <owners>Catalog.Контрагенты</owners>
  <attributes>
    <name>ВалютаВзаиморасчетов</name>
    <comment>(Общ) Определяет валюту взаиморасчетов по договору, не может меняться, если по договору проведен хотя бы один документ</comment>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>ВедениеВзаиморасчетов</name>
    <comment>(Общ)</comment>
    <type>
      <types>EnumRef.ВедениеВзаиморасчетовПоДоговорам</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидВзаиморасчетов</name>
    <comment>(Упр)</comment>
    <type>
      <types>CatalogRef.ВидыВзаиморасчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидУсловийДоговора</name>
    <comment>(Упр) </comment>
    <type>
      <types>EnumRef.ВидыУсловийДоговоровВзаиморасчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>ДержатьРезервБезОплатыОграниченноеВремя</name>
    <comment>(Упр) Держать резерв без оплаты ограниченное/неограниченное время</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДопустимаяСуммаЗадолженности</name>
    <comment>(Упр) </comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДопустимоеЧислоДнейЗадолженности</name>
    <comment>(Упр) </comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>(Общ) Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтролироватьСуммуЗадолженности</name>
    <comment>(Упр) </comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтролироватьЧислоДнейЗадолженности</name>
    <comment>(Упр) </comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбособленныйУчетТоваровПоЗаказамПокупателей</name>
    <comment>(Общ) Обособленный партионный учет Товаров по заказам покупателей</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <comment>(Общ) </comment>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроцентКомиссионногоВознаграждения</name>
    <comment>(Общ) </comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПроцентПредоплаты</name>
    <comment>(Упр) </comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СпособРасчетаКомиссионногоВознаграждения</name>
    <comment>(Общ) </comment>
    <type>
      <types>EnumRef.СпособыРасчетаКомиссионногоВознаграждения</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипЦен</name>
    <comment>(Общ) Тип цен по умолчанию для оформления покупок по данному договору</comment>
    <type>
      <types>CatalogRef.ТипыЦенНоменклатурыКонтрагентов</types>
      <types>CatalogRef.ТипыЦенНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>ЧислоДнейРезерваБезОплаты</name>
    <comment>(Упр) Если 0, то неограничено</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидДоговора</name>
    <comment>(Общ)</comment>
    <type>
      <types>EnumRef.ВидыДоговоровКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>СхемаНалоговогоУчета</name>
    <comment>(Регл)</comment>
    <type>
      <types>CatalogRef.СхемыНалоговогоУчетаПоДоговорамКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>СхемаНалоговогоУчетаПоТаре</name>
    <comment>(Регл) Схема налогового учета для операций взаиморасчетов по таре</comment>
    <type>
      <types>CatalogRef.СхемыНалоговогоУчетаПоДоговорамКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДеятельностиДляДДС</name>
    <comment>(Регл)</comment>
    <type>
      <types>EnumRef.ВидыДеятельностиДляДДС</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеДляПечати</name>
    <comment>(Общ)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВыводитьИнформациюОСделкеПриПечатиДокументов</name>
    <comment>(Общ)</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Дата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Номер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РеализацияНаЭкспорт</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВестиПоДокументамРасчетовСКонтрагентом</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнойПроект</name>
    <type>
      <types>CatalogRef.Проекты</types>
      <types>CatalogRef.ВидыРаспределенияПоПроектам</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнаяСтатьяДвиженияДенежныхСредств</name>
    <type>
      <types>CatalogRef.СтатьиДвиженияДенежныхСредств</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокДействия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КорректироватьВЛБпоВД</name>
    <comment>(только для ВЭД-договоров)</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КорректироватьВРпоВЛБ</name>
    <comment>(только для ВЭД-договоров)</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяВРКорректировок</name>
    <comment>для переоценки вал. задолженности по ВЛБ для сложного налогового учета</comment>
    <type>
      <types>CatalogRef.СтатьиНалоговыхДеклараций</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидНалоговойДеятельностиКорректировкиПриобретений</name>
    <comment>для переоценки вал. задолженности по ВЛБ </comment>
    <type>
      <types>CatalogRef.ВидыНалоговойДеятельности</types>
    </type>
  </attributes>
  <attributes>
    <name>ВедениеВзаиморасчетовРегл</name>
    <comment>(Общ)</comment>
    <type>
      <types>EnumRef.ВедениеВзаиморасчетовПоДоговорам</types>
    </type>
  </attributes>
  <attributes>
    <name>НеОтноситьНаЗатратыПоНУ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеКонтрагентаДляПечати</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>400</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

src/Enums/ВидыДоговоровКонтрагентов/ВидыДоговоровКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДоговоровКонтрагентов</name>
  <comment>(Общ)</comment>
  <enumValues>
    <name>СПоставщиком</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>СПокупателем</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>СКомитентом</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>СКомиссионером</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>Бартерный</name>
  </enumValues>
  <enumValues>
    <name>Прочее</name>
    <comment>(Общ)</comment>
  </enumValues>
</mdclass:Enum>

src/Catalogs/ДоговорыКонтрагентов/ObjectModule.bsl
////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТИРУЕМЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// Функция проверяет, существуют ли ссылки на договор в движениях регистров накопления.
// Если есть - нельзя менять:
//  - Валюту взаиморасчетов
//  - Ведение взаиморасчетов.
//
// Параметры:
//  Нет.
//
// Возвращаемое значение:
//  Истина - если есть движения, Ложь - если нет.
//
Функция СуществуютСсылки() Экспорт

	Возврат ПолныеПрава.ПроверитьНаличиеСсылокНаДоговорКонтрагента(Ссылка);

КонецФункции //  СуществуютСсылки()

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

// Процедура вызывается перед записью элемента справочника.
//
Процедура ПередЗаписью(Отказ)

	// Проверим можно ли изменять реквизиты договора.
	// Проверка осуществляется только если записывается уже существующий договор
	Если НЕ ОбменДанными.Загрузка И НЕ ЭтоНовый() Тогда

		Если ЭтоГруппа Тогда

			// Для группы владельца менять нельзя
			Если Владелец <> Ссылка.Владелец Тогда

				Сообщить("Нельзя изменять контрагента для группы договоров.", СтатусСообщения.Важное);
				Отказ = Истина;

			КонецЕсли; 

		Иначе

			// Проверим возможность смены владельца для договора
			Если Владелец <> Ссылка.Владелец Тогда

				Запрос = Новый Запрос;
				Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
				|	ДокументыПоДоговоруКонтрагента.Ссылка
				|ИЗ
				|	КритерийОтбора.ДокументыПоДоговоруКонтрагента(&Договор) КАК ДокументыПоДоговоруКонтрагента";
				
				Запрос.УстановитьПараметр("Договор", Ссылка);
				
				Результат = Запрос.Выполнить();
				ЕстьДокументыПоДоговору = НЕ Результат.Пустой();
				
				Если ЕстьДокументыПоДоговору Тогда
					Сообщить("Существуют документы, оформленные по договору """ + Наименование + """.
							 |Контрагент договора не может быть изменен, элемент не записан.", 
							 СтатусСообщения.Важное);
					Отказ = Истина;
				КонецЕсли; 

			КонецЕсли; 

			// Проверим возможность смены способа ведения взаиморасчетов и валюты взаиморасчетов
			
			Если (ВедениеВзаиморасчетов      <> Ссылка.ВедениеВзаиморасчетов 	  И ЗначениеЗаполнено(Ссылка.ВедениеВзаиморасчетов))
			 ИЛИ (ВалютаВзаиморасчетов       <> Ссылка.ВалютаВзаиморасчетов		  И ЗначениеЗаполнено(Ссылка.ВалютаВзаиморасчетов))
			 ИЛИ (ВидДоговора                <> Ссылка.ВидДоговора 				  И ЗначениеЗаполнено(Ссылка.ВидДоговора))
			 ИЛИ (Организация                <> Ссылка.Организация 				  И ЗначениеЗаполнено(Ссылка.Организация))
			 ИЛИ (СхемаНалоговогоУчета       <> Ссылка.СхемаНалоговогоУчета 	  И ЗначениеЗаполнено(Ссылка.СхемаНалоговогоУчета))
			 ИЛИ (СхемаНалоговогоУчетаПоТаре <> Ссылка.СхемаНалоговогоУчетаПоТаре И ЗначениеЗаполнено(Ссылка.СхемаНалоговогоУчетаПоТаре))
			 ИЛИ (ВидУсловийДоговора         <> Ссылка.ВидУсловийДоговора         И ЗначениеЗаполнено(Ссылка.ВидУсловийДоговора))
			 ИЛИ (ВедениеВзаиморасчетовРегл <> Ссылка.ВедениеВзаиморасчетовРегл И ЗначениеЗаполнено(Ссылка.ВедениеВзаиморасчетовРегл))
			 ИЛИ (ВестиПоДокументамРасчетовСКонтрагентом <> Ссылка.ВестиПоДокументамРасчетовСКонтрагентом И ЗначениеЗаполнено(Ссылка.ВестиПоДокументамРасчетовСКонтрагентом)) Тогда
			
			
				Если ЭтотОбъект.СуществуютСсылки() Тогда

					Сообщить("Существуют документы, проведенные по договору """ + Наименование + """.
							 |Реквизиты ""Организация"", ""Ведение взаиморасчетов"", ""Валюта взаиморасчетов"", ""Вид договора"", 
							 |""По документам расчетов с контрагентом"", ""Схема налогового учета"" и ""Условия выполнения договора"" не могут быть изменены, элемент не записан.", 
							 СтатусСообщения.Важное);
					Отказ = Истина;

				КонецЕсли;

			КонецЕсли;
			
			Если  ОбособленныйУчетТоваровПоЗаказамПокупателей<>Ссылка.ОбособленныйУчетТоваровПоЗаказамПокупателей Тогда
				Если ПолныеПрава.ПроверитьНаличиеСсылокНаДоговорКонтрагентаВЗаказахПокупателей(Ссылка) Тогда
					Сообщить("Существуют заказы покупателей, проведенные по договору """ + Наименование + """.
					|Реквизит ""Обособленный учет товаров по заказам покупателей"" не может быть изменен, элемент не записан.", 
					СтатусСообщения.Важное);
					Отказ = Истина;

				КонецЕсли;
				
			КонецЕсли;

		КонецЕсли;

	КонецЕсли;

	// Проверим заполнение и очистим неиспользуемые реквизиты элемента договора.
	Если Не ЭтоГруппа Тогда

		// Проверим, заполнена ли валюта.
		Если НЕ ОбменДанными.Загрузка И НЕ ЗначениеЗаполнено(ВалютаВзаиморасчетов) Тогда
			Сообщить("Не указана валюта договора.", СтатусСообщения.Важное);
			Отказ = Истина;
		КонецЕсли;

		// Проверим, заполнена ли организация.
		Если НЕ ОбменДанными.Загрузка И НЕ ЗначениеЗаполнено(Организация) Тогда
			Сообщить("Не указана организация, от которой заключен договор.", СтатусСообщения.Важное);
			Отказ = Истина;
		КонецЕсли;

		// Проверим, заполнен ли способ ведения взаиморасчетов.
		Если НЕ ОбменДанными.Загрузка И НЕ ЗначениеЗаполнено(ВедениеВзаиморасчетов) Тогда
			Сообщить("Не указан способ ведения взаиморасчетов по договору (УУ)", СтатусСообщения.Важное);
			Отказ = Истина;
		КонецЕсли;

		Если НЕ ОбменДанными.Загрузка И НЕ ЗначениеЗаполнено(ВедениеВзаиморасчетовРегл) Тогда
			Сообщить("Не указан способ ведения взаиморасчетов по договору (БУ и НУ).", СтатусСообщения.Важное);
			Отказ = Истина;
		КонецЕсли;
		
		// Проверим, заполнен ли вид договора.
		Если НЕ ОбменДанными.Загрузка Тогда
		
			Если НЕ ЗначениеЗаполнено(ВидДоговора) Тогда
				Сообщить("Не указан вид договора.", СтатусСообщения.Важное);
				Отказ = Истина;
			Иначе
				// Проверим, правильно ли заполнен вид договора
				Если (ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СПокупателем ИЛИ ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СКомиссионером)
					И НЕ Владелец.Покупатель Тогда
					Сообщить("Вид договора ""С покупателем"" может устанавливаться только когда у контрагента указано что он является покупателем.", СтатусСообщения.Важное);
					Отказ = Истина;
				ИначеЕсли (ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СПоставщиком ИЛИ ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СКомитентом)
					И НЕ Владелец.Поставщик Тогда
					Сообщить("Вид договора ""С поставщиком"" может устанавливаться только когда у контрагента указано что он является поставщиком.", СтатусСообщения.Важное);
					Отказ = Истина;
				ИначеЕсли ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.Прочее
					И ВестиПоДокументамРасчетовСКонтрагентом
					Тогда
					Сообщить("Флажок ""По документам расчетов с контрагентами"" не может устанавливаться у договоров с видом ""Прочее"".", СтатусСообщения.Важное);
					Отказ = Истина;
				КонецЕсли; 
			КонецЕсли;
		
		КонецЕсли; 

	КонецЕсли;

КонецПроцедуры // ПередЗаписью()
